### <font color="brown">Pandas - DataFrame Continued</font>

In [2]:
import numpy as np
import pandas as pd
from pandas import Series
from pandas import DataFrame

---

#### <font color="brown">Working with NaNs</font>

#### Remove rows/columns with NaNs using dropna

In [3]:
from numpy import nan as NA
datf = DataFrame([[1, 3.8, 2.1],
                  [2, NA, NA],
                  [NA, NA, NA],
                  [NA, 4.8, 1.7]])
datf

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

**Drop rows that have an NaN in any column**

In [4]:
datf.dropna()

     0    1    2
0  1.0  3.8  2.1

In [5]:
datf

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

Original is not modified, use inplace=True to modify original

In [6]:
datf1 = datf.copy()
datf1.dropna(inplace=True)
datf1

     0    1    2
0  1.0  3.8  2.1

In [9]:
# to do the same with columns, pass axis=1
datf.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

**To drop only those rows/columns that have NaN in ALL columns**

In [7]:
# drop rows that have NaNs in all columns
datf.dropna(how='all')

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
3  NaN  4.8  1.7

In [10]:
# drop rows that have NaNs in all columns
datf.dropna(how='all',axis=1)  # none of the columns are entirely NAs

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

#### Filling NaNs with values

**Replace all NaNs with single value**

In [12]:
datf

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

In [11]:
datf.fillna(0)

     0    1    2
0  1.0  3.8  2.1
1  2.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  4.8  1.7

**Replace all NaNs in row or column using ffill (forward fill)**

In [13]:
# column-wise
datf.fillna(method='ffill')

     0    1    2
0  1.0  3.8  2.1
1  2.0  3.8  2.1
2  2.0  3.8  2.1
3  2.0  4.8  1.7

In [15]:
datf   # original not modified

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

In [16]:
# row-wise
datf.fillna(method='ffill',axis=1)

     0    1    2
0  1.0  3.8  2.1
1  2.0  2.0  2.0
2  NaN  NaN  NaN
3  NaN  4.8  1.7

**Replace all NaNs in multiple columns using dictionary**

In [17]:
datf.fillna({1: 2.5, 2: 1.5})

     0    1    2
0  1.0  3.8  2.1
1  2.0  2.5  1.5
2  NaN  2.5  1.5
3  NaN  4.8  1.7

In [18]:
datf

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

**Treat column/row separately as Series, and use fillna**

In [23]:
# column as Series and fillna
datf[2].fillna(1.5)

0    2.1
1    1.5
2    1.5
3    1.7
Name: 2, dtype: float64

In [24]:
# row as Series, and fillna inplace
datfc = datf.copy()
datfc.loc[2].fillna(-1,inplace=True)
datfc

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2 -1.0 -1.0 -1.0
3  NaN  4.8  1.7

---
#### <font color="brown">One way to deal with missing numeric data is to replace with mean</font>

In [25]:
mpgfile = open("auto_mpg_original.csv")
mpgs = pd.read_csv(mpgfile)
mpgs

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8.0,307.0,130.0,3504.0,12.0,70.0,1.0,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693.0,11.5,70.0,1.0,buick skylark 320
2,18.0,8.0,318.0,150.0,3436.0,11.0,70.0,1.0,plymouth satellite
3,16.0,8.0,304.0,150.0,3433.0,12.0,70.0,1.0,amc rebel sst
4,17.0,8.0,302.0,140.0,3449.0,10.5,70.0,1.0,ford torino
...,...,...,...,...,...,...,...,...,...
401,27.0,4.0,140.0,86.0,2790.0,15.6,82.0,1.0,ford mustang gl
402,44.0,4.0,97.0,52.0,2130.0,24.6,82.0,2.0,vw pickup
403,32.0,4.0,135.0,84.0,2295.0,11.6,82.0,1.0,dodge rampage
404,28.0,4.0,120.0,79.0,2625.0,18.6,82.0,1.0,ford ranger
405,31.0,4.0,119.0,82.0,2720.0,19.4,82.0,1.0,chevy s-10

In [26]:
mpgs['mpg'].mean()

23.514572864321615

In [27]:
mpgs2 = mpgs.copy()

In [28]:
mpgs2[mpgs2['mpg'].isnull()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
10,NaN,4.0,133.0,115.0,3090.0,17.5,70.0,2.0,citroen ds-21 pallas
11,NaN,8.0,350.0,165.0,4142.0,11.5,70.0,1.0,chevrolet chevelle concours (sw)
12,NaN,8.0,351.0,153.0,4034.0,11.0,70.0,1.0,ford torino (sw)
13,NaN,8.0,383.0,175.0,4166.0,10.5,70.0,1.0,plymouth satellite (sw)
14,NaN,8.0,360.0,175.0,3850.0,11.0,70.0,1.0,amc rebel sst (sw)
17,NaN,8.0,302.0,140.0,3353.0,8.0,70.0,1.0,ford mustang boss 302
39,NaN,4.0,97.0,48.0,1978.0,20.0,71.0,2.0,volkswagen super beetle 117
367,NaN,4.0,121.0,110.0,2800.0,15.4,81.0,2.0,saab 900s

##### **Use fillna method on relevant column (Series)**

In [29]:
mpgs2['mpg'] = mpgs2['mpg'].fillna(mpgs2['mpg'].mean())

In [30]:
mpgs2.loc[10:14]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
10,23.514573,4.0,133.0,115.0,3090.0,17.5,70.0,2.0,citroen ds-21 pallas
11,23.514573,8.0,350.0,165.0,4142.0,11.5,70.0,1.0,chevrolet chevelle concours (sw)
12,23.514573,8.0,351.0,153.0,4034.0,11.0,70.0,1.0,ford torino (sw)
13,23.514573,8.0,383.0,175.0,4166.0,10.5,70.0,1.0,plymouth satellite (sw)
14,23.514573,8.0,360.0,175.0,3850.0,11.0,70.0,1.0,amc rebel sst (sw)

In [32]:
mpgs[mpgs['horsepower'].isnull()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
38,25.0,4.0,98.0,NaN,2046.0,19.0,71.0,1.0,ford pinto
133,21.0,6.0,200.0,NaN,2875.0,17.0,74.0,1.0,ford maverick
337,40.9,4.0,85.0,NaN,1835.0,17.3,80.0,2.0,renault lecar deluxe
343,23.6,4.0,140.0,NaN,2905.0,14.3,80.0,1.0,ford mustang cobra
361,34.5,4.0,100.0,NaN,2320.0,15.8,81.0,2.0,renault 18i
382,23.0,4.0,151.0,NaN,3035.0,20.5,82.0,1.0,amc concord dl

In [33]:
mpgs2['horsepower'] = mpgs2['horsepower'].fillna(mpgs2['horsepower'].mean())

In [34]:
mpgs2.loc[[38,133]]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
38,25.0,4.0,98.0,105.0825,2046.0,19.0,71.0,1.0,ford pinto
133,21.0,6.0,200.0,105.0825,2875.0,17.0,74.0,1.0,ford maverick

In [22]:
mpgs2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406 entries, 0 to 405
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           406 non-null    float64
 1   cylinders     406 non-null    float64
 2   displacement  406 non-null    float64
 3   horsepower    406 non-null    float64
 4   weight        406 non-null    float64
 5   acceleration  406 non-null    float64
 6   model year    406 non-null    float64
 7   origin        406 non-null    float64
 8   car name      406 non-null    object
dtypes: float64(8), object(1)
memory usage: 28.7+ KB

---

#### <font color="brown">General data frame manipulation</font>

**Column returned on indexing is a VIEW, so modifications will affect underlying dataframe column**

In [35]:
rand2d = np.random.random((3,2))
rand2d

array([[0.93827452, 0.61319907],
       [0.77302818, 0.44052771],
       [0.51492396, 0.36231492]])

In [37]:
randdf = DataFrame(rand2d, index=['one', 'two', 'three'],
                   columns = ['first', 'second'])
randdf

          first    second
one    0.938275  0.613199
two    0.773028  0.440528
three  0.514924  0.362315

In [38]:
col2 = randdf['second']
col2

one      0.613199
two      0.440528
three    0.362315
Name: second, dtype: float64

In [39]:
col2 += 0.05
print(col2,'\n')
print(randdf)

one      0.663199
two      0.490528
three    0.412315
Name: second, dtype: float64

          first    second
one    0.938275  0.663199
two    0.773028  0.490528
three  0.514924  0.412315

In [40]:
# if you don't want this, make an explicit copy of the returned column series
randdf['second'] -= 0.05
randdf

          first    second
one    0.938275  0.613199
two    0.773028  0.440528
three  0.514924  0.362315

In [41]:
col2 = randdf['second'].copy()
col2 += 0.05
print(col2,'\n')
print(randdf)

one      0.663199
two      0.490528
three    0.412315
Name: second, dtype: float64

          first    second
one    0.938275  0.613199
two    0.773028  0.440528
three  0.514924  0.362315

#### Adding dataframes together

In [42]:
rand2d = np.random.random((3,3))
randdf2 = DataFrame(rand2d, index=['one', 'two', 'four'],
                   columns = ['first', 'second', 'third'])
randdf2

         first    second     third
one   0.215845  0.734726  0.738844
two   0.686134  0.754819  0.606771
four  0.493609  0.194393  0.986083

In [43]:
randdf

          first    second
one    0.938275  0.613199
two    0.773028  0.440528
three  0.514924  0.362315

In [32]:
randdf + randdf2   # NaN will be used if either of a pair of aligned values is missing

          first    second  third
four        NaN       NaN    NaN
one    0.719385  1.455461    NaN
three       NaN       NaN    NaN
two    1.314304  0.935274    NaN

**Note that indexes are arranged in lexicographic order**

---

#### <font color="brown">Function Application and Mapping</font>

##### <font color="brown">apply, for Series objects of DataFrame (columns or rows)</font>

In [44]:
df = DataFrame(np.random.randn(4,3),columns=list("ABC"),index=["One","Two","Three",'Four'])
df

              A         B         C
One    1.410010 -0.636734 -0.198901
Two   -1.430924 -1.376101  1.005285
Three  1.193989  0.976391 -1.565162
Four   0.231086 -0.535847 -0.780603

In [45]:
dfabs = df.abs()
dfabs

              A         B         C
One    1.410010  0.636734  0.198901
Two    1.430924  1.376101  1.005285
Three  1.193989  0.976391  1.565162
Four   0.231086  0.535847  0.780603

**Function that rounds each item of a series that will be sent as parameter**

In [46]:
roundfn = lambda x: round(x,2)  # x is a Series

**Use apply method on dataframe with function as parameter, each column will be sent as argument to function**

In [47]:
dfabs.apply(roundfn)  # each column is sent in as an argument

          A     B     C
One    1.41  0.64  0.20
Two    1.43  1.38  1.01
Three  1.19  0.98  1.57
Four   0.23  0.54  0.78

In [48]:
dfabs  # original does not change

              A         B         C
One    1.410010  0.636734  0.198901
Two    1.430924  1.376101  1.005285
Three  1.193989  0.976391  1.565162
Four   0.231086  0.535847  0.780603

In [49]:
# or you can directly write the lambda as argument
dfabs.apply(lambda x: round(x,2))

          A     B     C
One    1.41  0.64  0.20
Two    1.43  1.38  1.01
Three  1.19  0.98  1.57
Four   0.23  0.54  0.78

In [50]:
# this makes it clear that apply is executed a column at a time (axis=0 is default)
dfabs.apply(lambda x: np.cumsum(x))

              A         B         C
One    1.410010  0.636734  0.198901
Two    2.840934  2.012835  1.204186
Three  4.034923  2.989227  2.769348
Four   4.266009  3.525074  3.549951

In [51]:
# you can define any function, not just lambdas
def roundsum(x):
    return round(np.cumsum(x),2)

In [52]:
dfabs.apply(roundsum)

          A     B     C
One    1.41  0.64  0.20
Two    2.84  2.01  1.20
Three  4.03  2.99  2.77
Four   4.27  3.53  3.55

In [53]:
dfabs

              A         B         C
One    1.410010  0.636734  0.198901
Two    1.430924  1.376101  1.005285
Three  1.193989  0.976391  1.565162
Four   0.231086  0.535847  0.780603

In [54]:
# a row at a time
dfabs.apply(roundsum,axis=1)

          A     B     C
One    1.41  2.05  2.25
Two    1.43  2.81  3.81
Three  1.19  2.17  3.74
Four   0.23  0.77  1.55

In [55]:
# of course, you can simply extract a column or row and send it 
dfabs['A'].apply(roundfn)

One      1.41
Two      1.43
Three    1.19
Four     0.23
Name: A, dtype: float64

In [65]:
# and if you are going to do this, you can use the Series map function
dfabs['B'].map(roundfn)

One      0.64
Two      1.38
Three    0.98
Four     0.54
Name: B, dtype: float64

In [66]:
dfabs

              A         B         C
One    1.410010  0.636734  0.198901
Two    1.430924  1.376101  1.005285
Three  1.193989  0.976391  1.565162
Four   0.231086  0.535847  0.780603

In [56]:
dfabs.loc['Two'].apply(roundfn)

A    1.43
B    1.38
C    1.01
Name: Two, dtype: float64

In [57]:
# since round is a Python function you can use it directly
dfabs.loc['Two'].round(2)

A    1.43
B    1.38
C    1.01
Name: Two, dtype: float64

In [58]:
dfabs

              A         B         C
One    1.410010  0.636734  0.198901
Two    1.430924  1.376101  1.005285
Three  1.193989  0.976391  1.565162
Four   0.231086  0.535847  0.780603

In [59]:
# for built-in Python functions, apply is generally unnecessary
dfabs.round(2)

          A     B     C
One    1.41  0.64  0.20
Two    1.43  1.38  1.01
Three  1.19  0.98  1.57
Four   0.23  0.54  0.78

In [67]:
# try mapping two rows
dfabs.loc[['Two','Three']].map(lambda x: round(x,2))

AttributeError: 'DataFrame' object has no attribute 'map'

In [68]:
# won't work because the indexing gives a dataframe, so use apply
dfabs.loc[['Two','Three']].apply(lambda x: round(x,2))

          A     B     C
Two    1.43  1.38  1.01
Three  1.19  0.98  1.57

---

##### <font color="brown">applymap, for one item of a DataFrame at a time</font>

In [60]:
dfabs.applymap(lambda x: round(x,2))

          A     B     C
One    1.41  0.64  0.20
Two    1.43  1.38  1.01
Three  1.19  0.98  1.57
Four   0.23  0.54  0.78

In [61]:
dfabs  # original not changed

              A         B         C
One    1.410010  0.636734  0.198901
Two    1.430924  1.376101  1.005285
Three  1.193989  0.976391  1.565162
Four   0.231086  0.535847  0.780603

In [62]:
dfabs.applymap(lambda x: np.round(np.cumsum(x),2))

            A       B       C
One    [1.41]  [0.64]   [0.2]
Two    [1.43]  [1.38]  [1.01]
Three  [1.19]  [0.98]  [1.57]
Four   [0.23]  [0.54]  [0.78]

##### **each item is treated like an ndarray, so cumulative sum is trivially done on a single item**

---

#### <font color="brown">Iterating over rows and columns of DataFrame</font>

##### <font color="brown">Iterating over rows using iterrows</font>

In [70]:
dfabs

              A         B         C
One    1.410010  0.636734  0.198901
Two    1.430924  1.376101  1.005285
Three  1.193989  0.976391  1.565162
Four   0.231086  0.535847  0.780603

In [71]:
dfround = dfabs.round(2)
dfround

          A     B     C
One    1.41  0.64  0.20
Two    1.43  1.38  1.01
Three  1.19  0.98  1.57
Four   0.23  0.54  0.78

In [72]:
for row in dfround.iterrows():
    print(row,'\n')

('One', A    1.41
B    0.64
C    0.20
Name: One, dtype: float64)

('Two', A    1.43
B    1.38
C    1.01
Name: Two, dtype: float64)

('Three', A    1.19
B    0.98
C    1.57
Name: Three, dtype: float64)

('Four', A    0.23
B    0.54
C    0.78
Name: Four, dtype: float64)

**Each row is returned as a tuple: first item is index label of row, second item is Series for row.<br>
For each row Series, its index are the column names, and values are values in that row**

In [73]:
for row in dfround.iterrows():
    ser = row[1]
    print(ser.index)
    print(ser.values)
    print('\n')

Index(['A', 'B', 'C'], dtype='object')
[1.41 0.64 0.2 ]


Index(['A', 'B', 'C'], dtype='object')
[1.43 1.38 1.01]


Index(['A', 'B', 'C'], dtype='object')
[1.19 0.98 1.57]


Index(['A', 'B', 'C'], dtype='object')
[0.23 0.54 0.78]

In [74]:
# retrieving column values individually
for row in dfround.iterrows():
    ser = row[1]
    for i,col in enumerate(ser.index):
        print(f'{col}: {ser.values[i]}')
    print('\n')

A: 1.41
B: 0.64
C: 0.2


A: 1.43
B: 1.38
C: 1.01


A: 1.19
B: 0.98
C: 1.57


A: 0.23
B: 0.54
C: 0.78

##### <font color="brown">Iterating over columns using iteritems</font>

In [75]:
dfround

          A     B     C
One    1.41  0.64  0.20
Two    1.43  1.38  1.01
Three  1.19  0.98  1.57
Four   0.23  0.54  0.78

In [76]:
for col in dfround.iteritems():
    print(col)
    print('\n')

('A', One      1.41
Two      1.43
Three    1.19
Four     0.23
Name: A, dtype: float64)


('B', One      0.64
Two      1.38
Three    0.98
Four     0.54
Name: B, dtype: float64)


('C', One      0.20
Two      1.01
Three    1.57
Four     0.78
Name: C, dtype: float64)

**Each column is returned as a tuple: first item is column name, second item is Series for column.<br>
For each Series, index is the row index, and values are values in that column**

---

---

#### <font color="brown">Grouping</font>

##### <font color="brown">Example 1a: State populations by year</font>

In [77]:
popdat = {'state': ['Arizona','Arizona','Arizona','Virginia','Virginia'],
          'year': [2005, 2010, 2015, 2010, 2015],
          'pop': [5.9, 6.6, 6.8, 7.9, 8.3]}
popdf = DataFrame(popdat)
popdf

      state  year  pop
0   Arizona  2005  5.9
1   Arizona  2010  6.6
2   Arizona  2015  6.8
3  Virginia  2010  7.9
4  Virginia  2015  8.3

In [78]:
# first group by year
yrgrp = popdf.groupby('year')
yrgrp

In [79]:
# then sum up within each group
df = yrgrp.sum()  # pop is the only numeric column, so sum applies to it
df

       pop
year
2005   5.9
2010  14.5
2015  15.1

In [88]:
df.index.name

'year'

In [80]:
df.reset_index()  # so we can have year as a column

   year   pop
0  2005   5.9
1  2010  14.5
2  2015  15.1

In [81]:
# in one shot
popdf.groupby('year').sum().reset_index()

   year   pop
0  2005   5.9
1  2010  14.5
2  2015  15.1

##### <font color="brown">Example 1b: State populations and debt by year</font>

In [82]:
popdf['debt'] = Series([1.2,1.2,1.1,0.9,1.2])
popdf

      state  year  pop  debt
0   Arizona  2005  5.9   1.2
1   Arizona  2010  6.6   1.2
2   Arizona  2015  6.8   1.1
3  Virginia  2010  7.9   0.9
4  Virginia  2015  8.3   1.2

In [84]:
popdf.groupby('year').sum().reset_index()

   year   pop  debt
0  2005   5.9   1.2
1  2010  14.5   2.1
2  2015  15.1   2.3

**Group sum is computed for both numeric columns**

##### <font color="brown">Example 2a: School graduates by year</font>

In [85]:
grads = pd.read_csv(open('graduates.csv'))
grads

   Student School  Graduating Year       Major
0         Rutgers             2012          CS
1      Penn State             2011          EE
2       Princeton             2013  Psychology
3             MIT             2010     Physics
4         Rutgers             2018        Math
5      Penn State             2019   Economics
6             MIT             2017          CS
7      Penn State             2015     Biology
8         Rutgers             2013  Philosophy
9       Princeton             2012   Economics
10        Rutgers             2015   Economics
11      Princeton             2018          CS
12     Penn State             2015   Economics
13           Yale             2012          CS
14        Rutgers             2013  Psychology

**Q. How many grads in 2012?**

In [86]:
gdf = grads.groupby('Graduating Year').count()
gdf

                 Student School  Major
Graduating Year
2010                          1      1
2011                          1      1
2012                          3      3
2013                          3      3
2015                          3      3
2017                          1      1
2018                          2      2
2019                          1      1

**The count function applied to each group**

In [87]:
gdf.loc[2012]['Major']

3

##### <font color="brown">Example 2b: School graduates by major, and within each major, by year</font>

**Q. How many Econ grads in 2105?**

**2-level grouping, first by major, then by graduating year within major**

In [89]:
gdf2 = grads.groupby(['Major','Graduating Year']).count()
gdf2

                            Student School
Major      Graduating Year
Biology    2015                          1
CS         2012                          2
           2017                          1
           2018                          1
EE         2011                          1
Economics  2012                          1
           2015                          2
           2019                          1
Math       2018                          1
Philosophy 2013                          1
Physics    2010                          1
Psychology 2013                          2

In [90]:
gdf2.loc['Economics',2015]

Student School    2
Name: (Economics, 2015), dtype: int64

In [92]:
gdf2.loc['Economics']

                 Student School
Graduating Year
2012                          1
2015                          2
2019                          1

In [94]:
type(gdf2.loc['Economics',2015])

pandas.core.series.Series

In [95]:
gdf2.loc['Economics',2015]['Student School']

2

In [96]:
gdf2_reset = gdf2.reset_index()
gdf2_reset

         Major  Graduating Year  Student School
0      Biology             2015               1
1           CS             2012               2
2           CS             2017               1
3           CS             2018               1
4           EE             2011               1
5    Economics             2012               1
6    Economics             2015               2
7    Economics             2019               1
8         Math             2018               1
9   Philosophy             2013               1
10     Physics             2010               1
11  Psychology             2013               2

In [97]:
gdf2_reset[(gdf2_reset['Major'] == 'Economics') & (gdf2_reset['Graduating Year'] == 2015)]

       Major  Graduating Year  Student School
6  Economics             2015               2

In [100]:
ser = gdf2_reset[(gdf2_reset['Major'] == 'Economics') & (gdf2_reset['Graduating Year'] == 2015)]['Student School']
ser

6    2
Name: Student School, dtype: int64

In [101]:
ser.values[0]

2

##### <font color="brown">Example 2c: Value Counts</font>

**Q. What are the top majors by number of graduates?**

In [102]:
grads

   Student School  Graduating Year       Major
0         Rutgers             2012          CS
1      Penn State             2011          EE
2       Princeton             2013  Psychology
3             MIT             2010     Physics
4         Rutgers             2018        Math
5      Penn State             2019   Economics
6             MIT             2017          CS
7      Penn State             2015     Biology
8         Rutgers             2013  Philosophy
9       Princeton             2012   Economics
10        Rutgers             2015   Economics
11      Princeton             2018          CS
12     Penn State             2015   Economics
13           Yale             2012          CS
14        Rutgers             2013  Psychology

In [106]:
major_counts = grads['Major'].value_counts()
major_counts

CS            4
Economics     4
Psychology    2
Biology       1
EE            1
Physics       1
Math          1
Philosophy    1
Name: Major, dtype: int64

In [108]:
major_counts[major_counts == major_counts.max()]

CS           4
Economics    4
Name: Major, dtype: int64

In [109]:
major_counts[major_counts == major_counts.max()].index.tolist()

['CS', 'Economics']

**Note above that an index can be converted to a list with the tolist method**

---

---

#### <font color="brown">Dropping rows or columns (variation of del operation for column)</font>

In [110]:
nparr = np.random.random((4,3))
randdf = DataFrame(nparr,index=['four','one','three','two'],columns=['first','second','third'])
randdf

          first    second     third
four   0.050395  0.775276  0.510268
one    0.197159  0.946895  0.485922
three  0.141285  0.399053  0.944409
two    0.317760  0.478682  0.672048

**Dropping rows**

In [111]:
randdf2 = randdf.drop(['four','three'])
randdf2

        first    second     third
one  0.197159  0.946895  0.485922
two  0.317760  0.478682  0.672048

In [112]:
randdf

          first    second     third
four   0.050395  0.775276  0.510268
one    0.197159  0.946895  0.485922
three  0.141285  0.399053  0.944409
two    0.317760  0.478682  0.672048

**Original is not changed**

In [113]:
rfcopy = randdf.copy()
del rfcopy['second']
rfcopy

          first     third
four   0.050395  0.510268
one    0.197159  0.485922
three  0.141285  0.944409
two    0.317760  0.672048

**But del for deleting column changes original**

In [115]:
# trying to drop column "third"
randdf.drop(['third'])

KeyError: "['third'] not found in axis"

**To make drop work for column need to use axis=1**

In [116]:
randdf.drop(['third'],axis=1)

          first    second
four   0.050395  0.775276
one    0.197159  0.946895
three  0.141285  0.399053
two    0.317760  0.478682

In [117]:
randdf

          first    second     third
four   0.050395  0.775276  0.510268
one    0.197159  0.946895  0.485922
three  0.141285  0.399053  0.944409
two    0.317760  0.478682  0.672048

**Use inplace=True to modify original**

In [118]:
rcopy = randdf.copy()
rcopy.drop(['three','four'],inplace=True)
rcopy

        first    second     third
one  0.197159  0.946895  0.485922
two  0.317760  0.478682  0.672048